# Taps
# (none currently needed)

# ══════════════════════════════════════════════════════════════
# CLI Tools (Formulae)
# ══════════════════════════════════════════════════════════════

# Version control
brew "git"
brew "git-lfs"
brew "gh"

# Dotfile management
brew "chezmoi"

# Shell enhancements
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Development tools
brew "nvm"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"

# Database
brew "postgresql@17"

# ══════════════════════════════════════════════════════════════
# GUI Applications (Casks)
# ══════════════════════════════════════════════════════════════

# Essential
cask "1password"
cask "1password-cli"
cask "iterm2"
cask "visual-studio-code"

# Development
cask "orbstack"

# ══════════════════════════════════════════════════════════════
# Optional - Uncomment as needed
# ══════════════════════════════════════════════════════════════

# Productivity
# cask "raycast"
# cask "obsidian"
# cask "notion"
# cask "fantastical"

# Communication
# cask "whatsapp"
# cask "zoom"

# Browsers
# cask "brave-browser"
# cask "google-chrome"

# Design
# cask "adobe-creative-cloud"
# cask "canva"

# Utilities
# cask "appcleaner"
# cask "cleanmymac"
# cask "bettertouchtool"
# cask "alt-tab"
# cask "stats"
# cask "sensei"

# Development extras
# cask "datagrip"
# cask "gitkraken"
# cask "cursor"
# cask "claude"
